package homeWork_6;

public class PhoneGenerator {
    static Phone[] phoneGenerate() {
        Phone[] phones = new Phone[13];
        phones[0] = new Phone(1,"Васильев","Вася","Васильевич","+380509587345",
                     "1234654578902344","1234","46",235,453,564);

        phones[1] = new Phone(2,"Петров","Петр","Петрович","+380504675678",
                "56778934567654","6543","13",456,0,679);

        phones[2] = new Phone(3,"Пушкин","Александр","Сергеевич","+3805034587567",
                "3212458756435665","8707","78",123,456,235);

        phones[3] = new Phone(4,"Селезнев","Роман","Анатольевич","+380504534554",
                "1212434356568778","7634","45",475,543,768);

        phones[4] = new Phone(5,"Авдеев","Шихаил","Алексеевич","+380507865632",
                "7656099809099090","7857","90",112,0,563);

        phones[5] = new Phone(6,"Галушко","Николай","Андреевич","+380502235467",
                "8989565678785656","3465","78",457,234,342);

        phones[6] = new Phone(7,"Дамилия6","Имя6","Отчество6","+38050563456",
                "3454657856344523","4567","23",452,779,213);

        phones[7] = new Phone(8,"Иамилия7","Имя7","Отчество7","+380505679890",
                "345465784556","4567","23",455,0,657);

        phones[8] = new Phone(9,"Уамилия8","Имя7","Отчество8","+380505679890",
                "345465783456","4567","23",223,789,564);

        phones[9] = new Phone(10,"Фамилия9","Имя9","Отчество9","+380505679890",
                "345465781212","4567","23",654,0,565);

        phones[10] = new Phone(11,"Яамилия10","Имя10","Отчество10","+380505679890",
                "345465782323","4567","23",341,0,796);

        phones[11] = new Phone(12,"Бамилия11","Имя11","Отчество11","+380505679890",
                "345465783435","4567","23",753,432,890);

        phones[12] = new Phone(13,"Самилия12","Имя12","Отчество12","+380505679890",
                "3454657834676","4567","23",689,0,563);

         return phones;
    }
}
